app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ?  ORDER BY "posts"."id" ASC LIMIT 1  [["user_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    user_id = params[:id]
    @posts = User.find(user_id).posts